Configuration/Catalogs/ТерриторииИПомещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТерриторииИПомещения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БрониВводитОтветственный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вместимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступнаСхема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступноБронирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйТехническоеОбеспечение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйХозяйственноеОбеспечение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлФотографии</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/Catalogs/МестаХраненияДел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>МестаХраненияДел</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапрещеноРазмещатьНовыеДела</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сокращение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерриторияПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТерриторииИПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/Catalogs/ТерриторииИПомещения/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Ссылка.Пустая() Тогда
		
		ПредыдущаяПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления");
		Если ПометкаУдаления <> ПредыдущаяПометкаУдаления Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ТерриторииИПомещения.Ссылка,
				|	ТерриторииИПомещения.ПометкаУдаления
				|ИЗ
				|	Справочник.ТерриторииИПомещения КАК ТерриторииИПомещения
				|ГДЕ
				|	ТерриторииИПомещения.Ссылка В ИЕРАРХИИ(&Ссылка)
				|	И ТерриторииИПомещения.Ссылка <> &Ссылка
				|	И ТерриторииИПомещения.ПометкаУдаления <> &ПометкаУдаления
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	МестаХраненияДел.Ссылка,
				|	МестаХраненияДел.ПометкаУдаления
				|ИЗ
				|	Справочник.МестаХраненияДел КАК МестаХраненияДел
				|ГДЕ
				|	МестаХраненияДел.ТерриторияПомещение В ИЕРАРХИИ(&Ссылка)
				|	И МестаХраненияДел.ПометкаУдаления <> &ПометкаУдаления";
				
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("ПометкаУдаления", ПометкаУдаления);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Объект = Выборка.Ссылка.ПолучитьОбъект();
				Объект.Заблокировать();
				Объект.УстановитьПометкуУдаления(ПометкаУдаления);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
		
// ХОЛД Начало
	БронированиеПомещенийХолдинг.ТерриторииИПомещенияПередЗаписью(ЭтотОбъект, Отказ);
// ХОЛД Конец
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если БрониВводитОтветственный Тогда
		ПроверяемыеРеквизиты.Добавить("Ответственный");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда 
		Ответственный = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОтветственныйТехническоеОбеспечение) Тогда 
		ОтветственныйТехническоеОбеспечение = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ОтветственныйХозяйственноеОбеспечение) Тогда 
		ОтветственныйХозяйственноеОбеспечение = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
// ХОЛД Начало
	БронированиеПомещенийХолдинг.ТерриторииИПомещенияОбработкаЗаполнения(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка);
// ХОЛД Конец
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ЗначениеЗаполнено(Ответственный) Тогда 
		Ответственный = Сотрудники.ОсновнойСотрудникПользователя(
			Ответственный);
	Иначе 
		Ответственный = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтветственныйТехническоеОбеспечение) Тогда 
		ОтветственныйТехническоеОбеспечение = Сотрудники.ОсновнойСотрудникПользователя(
			ОтветственныйТехническоеОбеспечение);
	Иначе
		ОтветственныйТехническоеОбеспечение = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтветственныйХозяйственноеОбеспечение) Тогда
		ОтветственныйХозяйственноеОбеспечение = Сотрудники.ОсновнойСотрудникПользователя(
			ОтветственныйХозяйственноеОбеспечение);
	Иначе
		ОтветственныйХозяйственноеОбеспечение = Справочники.Сотрудники.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
